; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l6-t1-p11---int100n150-m25---int100c110---s244---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 - fuellevel
)

(:init
(sum level0 level1 level1)
(sum level0 level2 level2)
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level8 level8)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level1 level1 level2)
(sum level1 level2 level3)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level8 level9)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level2 level1 level3)
(sum level2 level2 level4)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level8 level10)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level3 level1 level4)
(sum level3 level2 level5)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level8 level11)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level4 level1 level5)
(sum level4 level2 level6)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level8 level12)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level5 level1 level6)
(sum level5 level2 level7)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level8 level13)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level6 level1 level7)
(sum level6 level2 level8)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level8 level14)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level7 level1 level8)
(sum level7 level2 level9)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level8 level15)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level8 level1 level9)
(sum level8 level2 level10)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level8 level16)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level9 level1 level10)
(sum level9 level2 level11)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level8 level17)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level10 level1 level11)
(sum level10 level2 level12)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level8 level18)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level11 level1 level12)
(sum level11 level2 level13)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level8 level19)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level12 level1 level13)
(sum level12 level2 level14)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level8 level20)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level13 level1 level14)
(sum level13 level2 level15)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level8 level21)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level14 level1 level15)
(sum level14 level2 level16)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level8 level22)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level15 level1 level16)
(sum level15 level2 level17)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level8 level23)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level16 level1 level17)
(sum level16 level2 level18)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level8 level24)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level17 level1 level18)
(sum level17 level2 level19)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level8 level25)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level18 level1 level19)
(sum level18 level2 level20)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level8 level26)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level19 level1 level20)
(sum level19 level2 level21)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level8 level27)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level20 level1 level21)
(sum level20 level2 level22)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level8 level28)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level21 level1 level22)
(sum level21 level2 level23)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level8 level29)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level22 level1 level23)
(sum level22 level2 level24)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level8 level30)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level23 level1 level24)
(sum level23 level2 level25)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level8 level31)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level24 level1 level25)
(sum level24 level2 level26)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level8 level32)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level25 level1 level26)
(sum level25 level2 level27)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level8 level33)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level26 level1 level27)
(sum level26 level2 level28)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level8 level34)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level27 level1 level28)
(sum level27 level2 level29)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level8 level35)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level28 level1 level29)
(sum level28 level2 level30)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level8 level36)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level29 level1 level30)
(sum level29 level2 level31)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level8 level37)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level30 level1 level31)
(sum level30 level2 level32)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level8 level38)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level31 level1 level32)
(sum level31 level2 level33)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level8 level39)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level32 level1 level33)
(sum level32 level2 level34)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level8 level40)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level33 level1 level34)
(sum level33 level2 level35)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level8 level41)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level34 level1 level35)
(sum level34 level2 level36)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level8 level42)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level35 level1 level36)
(sum level35 level2 level37)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level8 level43)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level36 level1 level37)
(sum level36 level2 level38)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level8 level44)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level37 level1 level38)
(sum level37 level2 level39)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level8 level45)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level38 level1 level39)
(sum level38 level2 level40)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level8 level46)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level39 level1 level40)
(sum level39 level2 level41)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level8 level47)
(sum level39 level17 level56)
(sum level40 level1 level41)
(sum level40 level2 level42)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level8 level48)
(sum level40 level17 level57)
(sum level41 level1 level42)
(sum level41 level2 level43)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level8 level49)
(sum level41 level17 level58)
(sum level42 level1 level43)
(sum level42 level2 level44)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level8 level50)
(sum level42 level17 level59)
(sum level43 level1 level44)
(sum level43 level2 level45)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level8 level51)
(sum level44 level1 level45)
(sum level44 level2 level46)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level8 level52)
(sum level45 level1 level46)
(sum level45 level2 level47)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level8 level53)
(sum level46 level1 level47)
(sum level46 level2 level48)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level8 level54)
(sum level47 level1 level48)
(sum level47 level2 level49)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level8 level55)
(sum level48 level1 level49)
(sum level48 level2 level50)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level8 level56)
(sum level49 level1 level50)
(sum level49 level2 level51)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level8 level57)
(sum level50 level1 level51)
(sum level50 level2 level52)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level8 level58)
(sum level51 level1 level52)
(sum level51 level2 level53)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level8 level59)
(sum level52 level1 level53)
(sum level52 level2 level54)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level53 level1 level54)
(sum level53 level2 level55)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level54 level1 level55)
(sum level54 level2 level56)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level55 level1 level56)
(sum level55 level2 level57)
(sum level55 level4 level59)
(sum level56 level1 level57)
(sum level56 level2 level58)
(sum level57 level1 level58)
(sum level57 level2 level59)
(sum level58 level1 level59)

(connected l0 l1)
(fuelcost level4 l0 l1)
(connected l0 l5)
(fuelcost level21 l0 l5)
(connected l1 l0)
(fuelcost level4 l1 l0)
(connected l1 l2)
(fuelcost level5 l1 l2)
(connected l1 l3)
(fuelcost level1 l1 l3)
(connected l1 l4)
(fuelcost level2 l1 l4)
(connected l2 l1)
(fuelcost level5 l2 l1)
(connected l2 l4)
(fuelcost level8 l2 l4)
(connected l2 l5)
(fuelcost level17 l2 l5)
(connected l3 l1)
(fuelcost level1 l3 l1)
(connected l3 l4)
(fuelcost level8 l3 l4)
(connected l3 l5)
(fuelcost level17 l3 l5)
(connected l4 l1)
(fuelcost level2 l4 l1)
(connected l4 l2)
(fuelcost level8 l4 l2)
(connected l4 l3)
(fuelcost level8 l4 l3)
(connected l5 l0)
(fuelcost level21 l5 l0)
(connected l5 l2)
(fuelcost level17 l5 l2)
(connected l5 l3)
(fuelcost level17 l5 l3)

(at t0 l0)
(fuel t0 level59)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l3)
(at p3 l0)
(at p4 l5)
(at p5 l4)
(at p6 l1)
(at p7 l2)
(at p8 l4)
(at p9 l3)
(at p10 l4)
)

(:goal
(and
(at p0 l2)
(at p1 l5)
(at p2 l0)
(at p3 l4)
(at p4 l3)
(at p5 l3)
(at p6 l5)
(at p7 l4)
(at p8 l3)
(at p9 l5)
(at p10 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 11
2. (drive t0 l0 l1 level55 level4 level59)
   deleted: (at t0 l0) (fuel t0 level59)
   added: (at t0 l1) (fuel t0 level55)
   goals met: 0 of 11
3. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 0 of 11
4. (drive t0 l1 l3 level54 level1 level55)
   deleted: (at t0 l1) (fuel t0 level55)
   added: (at t0 l3) (fuel t0 level54)
   goals met: 0 of 11
5. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 0 of 11
6. (load p2 t0 l3)
   deleted: (at p2 l3)
   added: (in p2 t0)
   goals met: 0 of 11
7. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 0 of 11
8. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 11
9. (drive t0 l3 l5 level37 level17 level54)
   deleted: (at t0 l3) (fuel t0 level54)
   added: (at t0 l5) (fuel t0 level37)
   goals met: 0 of 11
10. (unload p9 t0 l5)
   deleted: (in p9 t0)
   added: (at p9 l5)
   goals met: 1 of 11
11. (unload p6 t0 l5)
   deleted: (in p6 t0)
   added: (at p6 l5)
   goals met: 2 of 11
12. (unload p1 t0 l5)
   deleted: (in p1 t0)
   added: (at p1 l5)
   goals met: 3 of 11
13. (load p4 t0 l5)
   deleted: (at p4 l5)
   added: (in p4 t0)
   goals met: 3 of 11
14. (drive t0 l5 l2 level20 level17 level37)
   deleted: (at t0 l5) (fuel t0 level37)
   added: (at t0 l2) (fuel t0 level20)
   goals met: 3 of 11
15. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 3 of 11
16. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 4 of 11
17. (drive t0 l2 l1 level15 level5 level20)
   deleted: (at t0 l2) (fuel t0 level20)
   added: (at t0 l1) (fuel t0 level15)
   goals met: 4 of 11
18. (drive t0 l1 l4 level13 level2 level15)
   deleted: (at t0 l1) (fuel t0 level15)
   added: (at t0 l4) (fuel t0 level13)
   goals met: 4 of 11
19. (load p10 t0 l4)
   deleted: (at p10 l4)
   added: (in p10 t0)
   goals met: 4 of 11
20. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 4 of 11
21. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 4 of 11
22. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 5 of 11
23. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 6 of 11
24. (drive t0 l4 l3 level5 level8 level13)
   deleted: (at t0 l4) (fuel t0 level13)
   added: (at t0 l3) (fuel t0 level5)
   goals met: 6 of 11
25. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 7 of 11
26. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 8 of 11
27. (unload p8 t0 l3)
   deleted: (in p8 t0)
   added: (at p8 l3)
   goals met: 9 of 11
28. (drive t0 l3 l1 level4 level1 level5)
   deleted: (at t0 l3) (fuel t0 level5)
   added: (at t0 l1) (fuel t0 level4)
   goals met: 9 of 11
29. (drive t0 l1 l0 level0 level4 level4)
   deleted: (at t0 l1) (fuel t0 level4)
   added: (at t0 l0) (fuel t0 level0)
   goals met: 9 of 11
30. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 10 of 11
31. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 11 of 11
